# encoding: UTF-8
module Stat

  class << self
    ##
    # Show the intermediate statistics based on Game's game_type
    # Please see methods "subtotal_*" for more detailed description
    #
    # Params:
    # - params {Hash} - Hash with Game and other possible parameters
    #
    def subtotal(params)
      game = params[:game]
      return {error: 'Game not found'} unless game

      begin
        subtotal_class = "stat_#{game.game_type}".classify.constantize
        subtotal_class.subtotal(params)
      rescue
        { error: "Game with game_type=\"#{game.game_type}\" cannot show subtotal!"}
      end
    end

    ##
    # Show the final statistics based on Game's game_type
    # Please see methods "total_*" for more detailed description
    #
    # Params:
    # - params {Hash} - Hash with Game and other possible parameters
    #
    def total(params)
      game = params[:game]
      return {error: 'Game not found'} unless game

      begin
        total_class = "stat_#{game.game_type}".classify.constantize
        total_class.total(params)
      rescue
        { error: "Game with game_type=\"#{game.game_type}\" cannot show total!"}
      end
    end

    ##
    # Show the statistics by each kingdoms.
    #
    # Params:
    # - params {Hash} - hash which contains Game and asking Team
    #   - game {Game} - current Game
    #   - asking_team {Team} - Team which is asking for statistics
    #
    #
    # Returns:
    # - {Array of Hash} - List of data by each kingdoms:
    #   - Name
    #   - Master
    #   - Code number of Master
    #   - How long is captured (in minutes)
    #   - Color of Master
    #   - Link to image of Master
    #   - Code number of asking team
    #
    # Example:
    #
    #   {
    #     1 => {
    #       name: 'Winterfell',
    #       team_codes: 12,
    #       holder: {
    #         name: 'Starks',
    #         codes: 15,
    #         time: '01:23:45',
    #         image: '/images/starks.png',
    #       },
    #     2 => {
    #       name: 'Casterly Rocks',
    #       team_codes: 12,
    #       holder: {
    #         name: 'Lannisters',
    #         codes: 11,
    #         time: '03:03:17',
    #         image: '/images/lannisters.png'
    #       },
    #     }
    #   }
    #
    def subtotal_zones(params)
      game = params[:game]
      asking_team = params[:team]
      return [] unless asking_team.present? && asking_team.is_a?(Team)

      result = {}
      Zone.where(game_id: game.id).each do |zone|
        holder = zone.holder
        if holder
          team = holder.team
          result.merge!({
            zone.id =>{
              name: zone.name,
              class: zone.css_class,
              team_codes: asking_team.codes_number_in_zone(zone).round(3),
              holder: {
                name:  team.name,
                codes: team.codes_number_in_zone(zone).round(3),
                time:  Time.at(Time.now.localtime - holder.time.localtime).gmtime.strftime('%H:%M:%S'),
                image: team.image_url
              }
            }
          })
        else
          result.merge!({
            zone.id =>{
              name: zone.name,
              class: zone.css_class,
              team_codes: 0,
              holder: {
                name:  'Free zone',
                codes: 0,
                time:  '00:00:00',
              }
            }
          })
        end
      end

      result
    end

    ##
    # Bonuses of holding for each team
    #
    def hold_bonuses(game)
      result = {}
      game.teams.each do |team|
        result[team.id] = {}
        game.zones.each do |zone|
          result[team.id][zone.id] = {}
          bonus = 0
          last_hold = nil
          ZoneHolder.where(game_id: game.id, zone_id: zone.id).order(:created_at).each do |hold|
            if hold.team_id != last_hold.try(:team_id)
              if last_hold.try(:team_id) == team.id
                bonus += ((hold.created_at - last_hold.created_at).to_i / 30) * 45
              end
              last_hold = hold
            end
          end
          if last_hold.try(:team_id) == team.id
            bonus += ((Time.parse('2013-04-14 08:00:00') - last_hold.created_at).to_i / game.hold_time) * game.hold_bonus
          end
          result[team.id][zone.id] = bonus
        end
      end
      result
    end

    ##
    # Reproduce all codes passing
    #
    def reprocess
      log = [
              ['06:59:03','free','принят','free','7','0',100,100,'viceversa@ex.ua'],
              ['06:59:49','free','принят','free','6','0',100,100,'viceversa@ex.ua'],
              ['07:00:25','free','принят','free','6','0',100,100,'viceversa@ex.ua'],
              ['07:00:37','free','принят','free','6','0',100,100,'viceversa@ex.ua'],
              ['07:00:49','free','принят','free','7','0',100,100,'viceversa@ex.ua'],
              ['07:00:56','free','принят','free','7','0',100,100,'viceversa@ex.ua'],
              ['07:01:06','free','принят','free','7','0',100,100,'viceversa@ex.ua'],
              ['07:01:17','free','принят','free','7','0',100,100,'viceversa@ex.ua'],
              ['07:01:24','free','принят','free','7','0',100,100,'viceversa@ex.ua'],
              ['07:01:28','free','принят','free','7','0',100,100,'viceversa@ex.ua'],
              ['07:01:40','free','принят','free','1','0',100,100,'viceversa@ex.ua'],
              ['06:59:00','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['06:59:35','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['06:59:53','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['07:00:05','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['07:00:16','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['07:00:23','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['07:00:29','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['07:00:35','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['07:00:42','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['07:00:47','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['07:01:38','free','принят','free','4','0',100,100,'garem@ex.ua'],
              ['06:58:23','Бонус Удар дракона','принят','2+','5','1',800,800,'viceversa@ex.ua'],
              ['06:57:29','bd21r9161','принят','1+','4','1',100,100,'garem@ex.ua'],
              ['06:57:11','767бастард','принят','null','4','7',200,200,'ktozdes@ex.ua'],
              ['06:55:08','zd9r','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:54:53','bd22r3911','принят','2','4','1',550,715,'garem@ex.ua'],
              ['06:54:00','bd21r7','принят','1+','2','1',100,100,'styd@ex.ua'],
              ['06:53:32','767вестерос','принят','null','4','7',200,200,'garem@ex.ua'],
              ['06:53:14','Hint 1961 (цена -60,0)','получена подсказка','','','4',-60,-60,'sad@ex.ua'],
              ['06:52:53','bd26r7213','принят','1+','2','1',100,100,'styd@ex.ua'],
              ['06:52:05','gold777','код доступа','null','4','',0,0,'strooks@ex.ua'],
              ['06:49:37','bd18r43','принят','1+','4','1',100,100,'garem@ex.ua'],
              ['06:49:05','zd11r8121983','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:48:17','bd25r521','принят','2+','4','1',800,1040,'garem@ex.ua'],
              ['06:45:21','bd24r42','принят','1+','2','1',100,100,'styd@ex.ua'],
              ['06:43:53','Бонус Пират','принят','null','4','6',300,300,'ktozdes@ex.ua'],
              ['06:42:21','zd6r34','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:39:26','bd11r739','принят','2','4','1',550,715,'garem@ex.ua'],
              ['06:39:16','zd4r87','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:35:39','zd1r724','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:34:17','bd4r','принят','1+','2','1',100,100,'styd@ex.ua'],
              ['06:33:59','bd29r9929','принят','1+','2','1',100,100,'styd@ex.ua'],
              ['06:32:56','bd15r9922','принят','1','2','1',80,80,'styd@ex.ua'],
              ['06:32:09','bd8r4396','принят','1','4','1',80,80,'garem@ex.ua'],
              ['06:31:41','bd24r3714','принят','1+','4','1',100,100,'garem@ex.ua'],
              ['06:30:58','zd5r72','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:30:30','zd2r817','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:30:23','Бонус Удар дракона','принят','2+','5','1',800,800,'viceversa@ex.ua'],
              ['06:30:09','bd14r1','принят','1+','2','1',100,100,'styd@ex.ua'],
              ['06:29:29','bd1r171','принят','3','4','1',116,116,'garem@ex.ua'],
              ['06:28:06','bd16r2429','принят','1+','2','1',100,100,'styd@ex.ua'],
              ['06:27:37','zd3r333','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:27:07','br3d41172667','принят','1','4','1',80,80,'garem@ex.ua'],
              ['06:26:59','bd9r9333','принят','1+','2','1',100,100,'styd@ex.ua'],
              ['06:26:40','zd14r131','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:26:23','Бонус Пират','принят','null','4','4',400,400,'ktozdes@ex.ua'],
              ['06:25:59','bd28r1943','принят','2+','4','1',800,1040,'garem@ex.ua'],
              ['06:25:01','zd15r7','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:24:45','Бонус Подкуп','принят','null','4','7',200,200,'sad@ex.ua'],
              ['06:24:24','Бонус Песчаные змейки','принят','null','4','4',400,400,'garem@ex.ua'],
              ['06:23:29','bd9r9612','принят','1+','4','1',100,100,'garem@ex.ua'],
              ['06:22:37','pirates22','код доступа','null','7','',0,0,'sad@ex.ua'],
              ['06:22:10','bd12r48','принят','1','4','1',80,80,'garem@ex.ua'],
              ['06:21:30','bd23r443','принят','1','4','1',80,80,'garem@ex.ua'],
              ['06:21:26','zd10r270387','принят','bonus','0','1',100,100,'viceversa@ex.ua'],
              ['06:20:09','br2d8','принят','1+','2','1',100,100,'styd@ex.ua'],
              ['06:19:40','767дредфорт','принят','null','4','7',200,200,'garem@ex.ua'],
              ['06:19:29','bd19r119','принят','1+','2','1',100,100,'styd@ex.ua'],
              ['06:17:40','dorn1234','код доступа','null','2','',0,0,'viceversa@ex.ua'],
              ['06:12:01','767дондаррион','принят','null','4','7',200,200,'garem@ex.ua'],
              ['06:10:34','767бастард','принят','null','4','7',200,200,'garem@ex.ua'],
              ['06:09:46','Бонус Удар дракона','принят','2+','5','1',800,800,'viceversa@ex.ua'],
              ['06:09:06','fish17','код доступа','null','6','',0,0,'styd@ex.ua'],
              ['06:07:50','br3d','принят','1','2','1',80,80,'styd@ex.ua'],
              ['06:07:03','gold777','код доступа','null','4','',0,0,'garem@ex.ua'],
              ['06:05:06','dorn1234','код доступа','null','2','',0,0,'ktozdes@ex.ua'],
              ['06:02:08','Бонус Пират','принят','2','1','1',550,550,'ktozdes@ex.ua'],
              ['05:55:58','whiteeagle','код доступа','null','5','',0,0,'strooks@ex.ua'],
              ['05:53:12','whiteeagle','код доступа','null','5','',0,0,'viceversa@ex.ua'],
              ['05:49:16','Бонус Удар дракона','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['05:41:18','Hint 1958 (цена -60,0)','получена подсказка','','','3',-60,-60,'styd@ex.ua'],
              ['05:35:40','whiteeagle','код доступа','null','5','',0,0,'ktozdes@ex.ua'],
              ['05:34:21','737эйгон','принят','null','1','7',200,200,'viceversa@ex.ua'],
              ['05:33:48','Hint 1955 (цена -90,0)','получена подсказка','','','3',-90,-90,'styd@ex.ua'],
              ['05:30:51','Бонус Верность королю','принят','3+','1','1',100,210,'styd@ex.ua'],
              ['05:28:51','Бонус Удар дракона','принят','null','1','4',200,200,'viceversa@ex.ua'],
              ['05:28:51','737визерис','принят','null','1','7',200,200,'viceversa@ex.ua'],
              ['05:27:52','br1d427','принят','2+','3','1',800,1040,'garem@ex.ua'],
              ['05:27:25','Бонус Пират','принят','2+','4','1',800,960,'ktozdes@ex.ua'],
              ['05:26:24','bd9r2142168418','принят','1+','3','1',100,100,'garem@ex.ua'],
              ['05:24:28','bd5r11','принят','3+','3','2',100,210,'styd@ex.ua'],
              ['05:24:16','Бонус Подкуп','принят','null','4','6',300,300,'sad@ex.ua'],
              ['05:24:13','bd26r611','принят','3+','4','1',100,100,'ktozdes@ex.ua'],
              ['05:21:25','bd8r1212','принят','2+','3','1',800,1040,'garem@ex.ua'],
              ['05:21:22','bd29r1585','принят','3+','4','1',100,100,'ktozdes@ex.ua'],
              ['05:20:30','bd7r2986','принят','3','3','2',116,243,6,'styd@ex.ua'],
              ['05:20:13','bd28r1943','принят','2+','4','1',800,960,'ktozdes@ex.ua'],
              ['05:18:24','bd7r4312','принят','2+','3','1',800,1040,'garem@ex.ua'],
              ['05:17:57','bd10r101010','принят','3','3','2',116,243,6,'styd@ex.ua'],
              ['05:17:40','bd24r3714','принят','1+','4','1',100,100,'ktozdes@ex.ua'],
              ['05:14:39','bd9r9612','принят','1+','4','1',100,100,'ktozdes@ex.ua'],
              ['05:13:28','bd6r49','принят','1','3','1',80,80,'garem@ex.ua'],
              ['05:11:16','Бонус Пират','принят','2+','1','1',800,960,'ktozdes@ex.ua'],
              ['05:10:59','bd3r99558','принят','3+','3','2',100,210,'styd@ex.ua'],
              ['05:09:11','bd16r3412','принят','1+','4','1',100,100,'ktozdes@ex.ua'],
              ['05:08:28','Бонус Удар дракона','принят','2','1','2',550,550,'viceversa@ex.ua'],
              ['05:07:12','bd2r228311','принят','3','3','2',116,243,6,'styd@ex.ua'],
              ['05:06:12','767дондаррион','принят','null','4','7',200,200,'viceversa@ex.ua'],
              ['04:58:39','bd14r85','принят','1+','4','1',100,100,'ktozdes@ex.ua'],
              ['04:56:44','bd1r171','принят','3','4','1',116,116,'ktozdes@ex.ua'],
              ['04:56:11','gold777','код доступа','null','4','',0,0,'viceversa@ex.ua'],
              ['04:54:10','bd9r733','принят','1+','1','2',100,100,'viceversa@ex.ua'],
              ['04:52:39','Бонус Пират','принят','2+','3','1',800,960,'ktozdes@ex.ua'],
              ['04:51:01','bd8r1111','принят','1+','1','2',100,100,'viceversa@ex.ua'],
              ['04:48:22','Бонус Удар дракона','принят','2+','1','1',800,800,'viceversa@ex.ua'],
              ['04:48:20','bd11r739','принят','2','4','1',550,550,'ktozdes@ex.ua'],
              ['04:48:12','bd11r7891','принят','1','3','1',80,80,'garem@ex.ua'],
              ['04:48:11','bd17r7411','принят','3+','4','1',100,100,'ktozdes@ex.ua'],
              ['04:47:52','bd21r9161','принят','1+','4','1',100,100,'ktozdes@ex.ua'],
              ['04:46:51','bd7r911','принят','1+','1','2',100,100,'viceversa@ex.ua'],
              ['04:46:45','fish17','код доступа','null','6','',0,0,'sad@ex.ua'],
              ['04:45:40','bd13r8424','принят','1','3','1',80,80,'garem@ex.ua'],
              ['04:44:28','bd15r7841','принят','1+','3','1',100,100,'garem@ex.ua'],
              ['04:43:31','bd18r43','принят','1+','4','1',100,100,'ktozdes@ex.ua'],
              ['04:43:31','br2d7142874','принят','1+','3','1',100,100,'garem@ex.ua'],
              ['04:41:39','bd13r','принят','1+','4','1',100,100,'ktozdes@ex.ua'],
              ['04:40:56','bd4r1','принят','1+','4','1',100,100,'ktozdes@ex.ua'],
              ['04:40:30','bd8r4396','принят','1','4','1',80,80,'ktozdes@ex.ua'],
              ['04:40:08','bd26r272985','принят','1','3','1',80,80,'garem@ex.ua'],
              ['04:38:54','bd26r6629','принят','2','1','1',550,550,'viceversa@ex.ua'],
              ['04:35:03','756мартелл','принят','null','3','6',200,200,'garem@ex.ua'],
              ['04:34:47','Бонус Пират','принят','2+','3','1',800,960,'ktozdes@ex.ua'],
              ['04:34:28','bd12r48','принят','1','4','1',80,80,'ktozdes@ex.ua'],
              ['04:34:21','br3d6571','принят','1','1','1',80,80,'viceversa@ex.ua'],
              ['04:33:50','bd29r92','принят','1','1','1',80,80,'viceversa@ex.ua'],
              ['04:33:25','bd2r3189','принят','1+','1','2',100,100,'viceversa@ex.ua'],
              ['04:33:04','bd25r521','принят','2+','4','1',800,960,'ktozdes@ex.ua'],
              ['04:33:01','dorn1234','код доступа','null','2','',0,0,'strooks@ex.ua'],
              ['04:32:50','756браавос','принят','null','3','6',200,200,'garem@ex.ua'],
              ['04:32:32','br2d384','принят','1','1','1',80,80,'viceversa@ex.ua'],
              ['04:32:12','756ботли','принят','null','3','6',200,200,'garem@ex.ua'],
              ['04:31:44','756тирион','принят','null','3','6',200,200,'garem@ex.ua'],
              ['04:31:22','bd24r41','принят','1','1','1',80,80,'viceversa@ex.ua'],
              ['04:30:34','bd17r63','принят','1','1','1',80,80,'viceversa@ex.ua'],
              ['04:30:21','bd18r51','принят','1','1','1',80,80,'viceversa@ex.ua'],
              ['04:30:08','756шагга','принят','null','3','6',200,200,'garem@ex.ua'],
              ['04:30:07','bd4r222','принят','1+','1','2',100,100,'viceversa@ex.ua'],
              ['04:29:07','bd1r452','принят','2','1','2',550,550,'viceversa@ex.ua'],
              ['04:28:16','Бонус Удар дракона','принят','null','1','6',200,200,'viceversa@ex.ua'],
              ['04:27:33','bd9r992','принят','1','1','1',80,80,'viceversa@ex.ua'],
              ['04:27:26','dorn1234','код доступа','null','2','',0,0,'styd@ex.ua'],
              ['04:27:03','bd6r8119','принят','1','5','1',80,80,'styd@ex.ua'],
              ['04:26:33','bd10r8338','принят','1','1','2',80,80,'viceversa@ex.ua'],
              ['04:23:30','storm12','код доступа','null','3','',0,0,'garem@ex.ua'],
              ['04:23:05','br3d41172667','принят','1','4','1',80,80,'ktozdes@ex.ua'],
              ['04:21:23','bd22r3911','принят','2','4','1',550,550,'ktozdes@ex.ua'],
              ['04:20:19','bd14r274','принят','3','5','1',116,243,6,'styd@ex.ua'],
              ['04:19:23','bd23r443','принят','1','4','1',80,80,'ktozdes@ex.ua'],
              ['04:18:37','bd15r','принят','1+','1','1',100,100,'viceversa@ex.ua'],
              ['04:18:17','bd19r714','принят','2','1','1',550,550,'viceversa@ex.ua'],
              ['04:17:55','Бонус Пират','принят','2+','1','1',800,960,'ktozdes@ex.ua'],
              ['04:17:45','bd8r749','принят','2+','5','1',800,800,'styd@ex.ua'],
              ['04:15:43','t3t2','код доступа','null','3','',-500,-500,'styd@ex.ua'],
              ['04:15:36','bd2r516771','принят','3','1','1',116,116,'viceversa@ex.ua'],
              ['04:14:38','bd11r1111','принят','2+','5','1',800,800,'styd@ex.ua'],
              ['04:14:30','Бонус Подкуп','принят','null','4','4',400,400,'sad@ex.ua'],
              ['04:13:15','bd10r334','принят','1+','5','1',100,100,'styd@ex.ua'],
              ['04:12:54','Рглор','принят','null','7','3',400,600,'strooks@ex.ua'],
              ['04:12:44','bd16r51','принят','3+','1','1',100,100,'viceversa@ex.ua'],
              ['04:12:31','bd27r78586','принят','1','1','1',80,80,'viceversa@ex.ua'],
              ['04:09:44','bd1r243','принят','2+','1','1',800,800,'viceversa@ex.ua'],
              ['04:09:06','bd11r4196','принят','1+','1','1',100,100,'viceversa@ex.ua'],
              ['04:07:36','t1t2','код доступа','null','1','',-500,-500,'viceversa@ex.ua'],
              ['04:07:16','Бонус Удар дракона','принят','null','1','5',200,200,'viceversa@ex.ua'],
              ['04:03:29','bd13r73','принят','1+','1','1',100,100,'viceversa@ex.ua'],
              ['04:03:20','bd12r66','принят','2','1','1',550,550,'viceversa@ex.ua'],
              ['04:03:01','bd7r225','принят','1+','1','1',100,100,'viceversa@ex.ua'],
              ['04:02:03','bd4r356','принят','3','1','1',116,116,'viceversa@ex.ua'],
              ['04:02:02','t7t2','код доступа','null','7','',-500,-500,'garem@ex.ua'],
              ['04:00:40','gold777','код доступа','null','4','',0,0,'ktozdes@ex.ua'],
              ['04:00:07','786кольчуга','принят','null','6','6',200,200,'garem@ex.ua'],
              ['03:59:56','bd13r73','принят','1+','1','1',100,100,'ktozdes@ex.ua'],
              ['03:59:54','bd5r28','принят','1+','1','1',100,100,'viceversa@ex.ua'],
              ['03:58:18','bd3r1819','принят','2+','1','1',800,800,'viceversa@ex.ua'],
              ['03:49:09','Бонус Верность королю','принят','3','3','1',116,243,6,'styd@ex.ua'],
              ['03:44:49','Бонус Пират','принят','2+','1','1',800,960,'ktozdes@ex.ua'],
              ['03:41:22','Мирри Маз Дуур','принят','null','5','5',200,200,'styd@ex.ua'],
              ['03:39:54','Бонус Удар дракона','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['03:36:52','bd7r8452','принят','3','5','1',116,116,'garem@ex.ua'],
              ['03:29:14','whiteeagle','код доступа','null','5','',0,0,'styd@ex.ua'],
              ['03:26:49','bd13r3653','принят','1','7','1',80,80,'garem@ex.ua'],
              ['03:26:39','bd19r76','принят','1+','7','1',100,100,'garem@ex.ua'],
              ['03:22:45','bd16r6621','принят','1+','7','1',100,100,'garem@ex.ua'],
              ['03:21:42','bd26r6629','принят','2','1','1',550,550,'ktozdes@ex.ua'],
              ['03:20:49','bd17r','принят','1','7','1',80,80,'garem@ex.ua'],
              ['03:19:30','Бонус Удар дракона','принят','1','7','2',80,80,'viceversa@ex.ua'],
              ['03:18:17','737сандор','принят','null','1','7',200,200,'viceversa@ex.ua'],
              ['03:17:27','786переправа','принят','null','6','6',200,300,'strooks@ex.ua'],
              ['03:17:19','bd21r2133','принят','1','7','1',80,80,'garem@ex.ua'],
              ['03:16:41','bd26r8','принят','1+','7','1',100,100,'garem@ex.ua'],
              ['03:15:50','питахайя','принят','null','7','4',400,400,'garem@ex.ua'],
              ['03:15:11','winter1304','код доступа','null','1','',0,0,'viceversa@ex.ua'],
              ['03:13:41','br3d6571','принят','1','1','1',80,80,'ktozdes@ex.ua'],
              ['03:13:35','fish17','код доступа','null','6','',0,0,'strooks@ex.ua'],
              ['03:12:26','кентавр','принят','null','4','3',200,200,'styd@ex.ua'],
              ['03:09:58','bd24r41','принят','1','1','1',80,80,'ktozdes@ex.ua'],
              ['03:09:46','dorn1234','код доступа','null','2','',0,0,'sad@ex.ua'],
              ['03:08:51','br2d384','принят','1','1','1',80,80,'ktozdes@ex.ua'],
              ['03:07:11','bd18r51','принят','1','1','1',80,80,'ktozdes@ex.ua'],
              ['03:06:50','bd17r63','принят','1','1','1',80,80,'ktozdes@ex.ua'],
              ['03:03:47','bd5r426','принят','1+','5','1',100,100,'garem@ex.ua'],
              ['03:03:39','bd27r888','принят','1+','7','1',100,100,'garem@ex.ua'],
              ['03:02:34','bd28r8276','принят','1','7','1',80,80,'garem@ex.ua'],
              ['03:01:24','bd27r78586','принят','1','1','1',80,80,'ktozdes@ex.ua'],
              ['03:00:21','756шагга','принят','null','3','6',200,200,'styd@ex.ua'],
              ['02:58:57','Бонус Удар дракона','принят','3+','7','2',100,100,'viceversa@ex.ua'],
              ['02:58:20','bd4r821','принят','1+','5','1',100,100,'garem@ex.ua'],
              ['02:58:20','bd12r43','принят','3+','5','1',100,100,'garem@ex.ua'],
              ['02:57:02','bd17r82','принят','1+','5','1',100,100,'garem@ex.ua'],
              ['02:56:51','745вардис','принят','null','2','5',190,190,'garem@ex.ua'],
              ['02:55:38','Великая септа Бейлора','принят','null','3','3',300,300,'a@ex.ua'],
              ['02:55:11','bd9r473','принят','2+','5','1',800,1040,'garem@ex.ua'],
              ['02:54:43','795летопись','принят','null','7','5',200,200,'garem@ex.ua'],
              ['02:53:29','bd17r','принят','1','7','1',80,80,'strooks@ex.ua'],
              ['02:53:23','bd19r76','принят','1+','7','1',100,100,'strooks@ex.ua'],
              ['02:53:18','bd28r8276','принят','1','7','1',80,80,'strooks@ex.ua'],
              ['02:53:11','795караван','принят','null','7','5',200,200,'garem@ex.ua'],
              ['02:53:03','bd27r888','принят','1+','7','1',100,100,'strooks@ex.ua'],
              ['02:52:58','bd3r184','принят','1','7','1',80,80,'strooks@ex.ua'],
              ['02:52:53','bd26r8','принят','1+','7','1',100,100,'strooks@ex.ua'],
              ['02:52:48','bd18r1984','принят','1','7','1',80,80,'strooks@ex.ua'],
              ['02:52:41','bd8r8962','принят','1','7','1',80,80,'strooks@ex.ua'],
              ['02:52:36','bd21r2133','принят','1','7','1',80,80,'strooks@ex.ua'],
              ['02:52:32','bd7r2112','принят','1','7','1',80,80,'strooks@ex.ua'],
              ['02:52:20','br1d32','принят','1','7','1',80,80,'strooks@ex.ua'],
              ['02:52:18','Рглор','принят','null','7','3',400,400,'garem@ex.ua'],
              ['02:52:06','bd5r9119','принят','1','7','1',80,80,'strooks@ex.ua'],
              ['02:52:06','795засада','принят','null','7','5',200,200,'garem@ex.ua'],
              ['02:51:50','bd22r411','принят','1+','7','1',100,100,'strooks@ex.ua'],
              ['02:49:27','bd1r99','принят','1','7','1',80,80,'strooks@ex.ua'],
              ['02:49:25','756моргулис','принят','null','3','6',200,200,'viceversa@ex.ua'],
              ['02:48:24','795молитва','принят','null','7','5',200,200,'garem@ex.ua'],
              ['02:48:03','795летопись','принят','null','7','5',200,300,'strooks@ex.ua'],
              ['02:47:58','bd3r817','принят','3','4','1',116,116,'sad@ex.ua'],
              ['02:47:45','bd15r77','принят','1+','5','1',100,100,'garem@ex.ua'],
              ['02:46:30','pirates22','код доступа','null','7','',0,0,'garem@ex.ua'],
              ['02:46:13','bd8r749','принят','2+','5','1',800,1040,'garem@ex.ua'],
              ['02:46:09','767дредфорт','принят','null','4','7',200,200,'styd@ex.ua'],
              ['02:45:59','bd1r423','принят','2+','5','1',800,1040,'garem@ex.ua'],
              ['02:44:35','bd2r248','принят','1+','5','1',100,100,'garem@ex.ua'],
              ['02:44:02','bd24r7','принят','2','5','1',550,715,'garem@ex.ua'],
              ['02:43:53','bd23r17','принят','1+','5','1',100,100,'garem@ex.ua'],
              ['02:43:24','795караван','принят','null','7','5',200,300,'strooks@ex.ua'],
              ['02:42:15','bd9r9612','принят','1+','4','1',100,100,'styd@ex.ua'],
              ['02:41:57','Бонус Подкуп','принят','2','4','1',550,550,'sad@ex.ua'],
              ['02:41:40','bd20r494','принят','2+','5','1',800,1040,'garem@ex.ua'],
              ['02:40:06','bd14r274','принят','3','5','1',116,116,'garem@ex.ua'],
              ['02:38:51','756браавос','принят','null','3','6',200,200,'viceversa@ex.ua'],
              ['02:38:33','bd3r817','принят','3','4','1',116,243,6,'styd@ex.ua'],
              ['02:38:27','786королева','принят','null','6','6',200,200,'garem@ex.ua'],
              ['02:36:40','winter1304','код доступа','null','1','',0,0,'ktozdes@ex.ua'],
              ['02:36:39','bd19r4553','принят','1','5','1',80,80,'garem@ex.ua'],
              ['02:36:14','bd10r334','принят','1+','5','1',100,100,'garem@ex.ua'],
              ['02:35:48','786переправа','принят','null','6','6',200,200,'garem@ex.ua'],
              ['02:35:16','bd11r1111','принят','2+','5','1',800,1040,'garem@ex.ua'],
              ['02:35:15','Бонус Удар дракона','принят','2','6','1',550,550,'viceversa@ex.ua'],
              ['02:34:54','bd21r7788','принят','1+','5','1',100,100,'garem@ex.ua'],
              ['02:33:15','bd4r1','принят','1+','4','1',100,100,'styd@ex.ua'],
              ['02:33:11','bd4r1331','принят','1+','7','2',100,100,'viceversa@ex.ua'],
              ['02:31:54','bd22r521','принят','1+','5','1',100,100,'garem@ex.ua'],
              ['02:31:41','bd1r171','принят','3','4','1',116,243,6,'styd@ex.ua'],
              ['02:30:20','bd3r999','принят','3+','5','1',100,100,'garem@ex.ua'],
              ['02:29:59','bd13r997','принят','1+','5','1',100,100,'garem@ex.ua'],
              ['02:29:30','bd6r8119','принят','1','5','1',80,80,'garem@ex.ua'],
              ['02:29:21','756ботли','принят','null','3','6',200,200,'viceversa@ex.ua'],
              ['02:28:57','bd2r745','принят','3+','7','2',100,100,'viceversa@ex.ua'],
              ['02:28:32','bd1r721','принят','1+','7','2',100,100,'viceversa@ex.ua'],
              ['02:26:22','bd15r7841','принят','1+','3','1',100,100,'ktozdes@ex.ua'],
              ['02:25:31','756мартелл','принят','null','3','6',200,200,'viceversa@ex.ua'],
              ['02:24:35','bd17r7411','принят','3+','4','1',100,210,'styd@ex.ua'],
              ['02:23:57','776рыцарь','принят','null','5','6',200,200,'garem@ex.ua'],
              ['02:22:57','18герб','принят','null','5','4',300,300,'garem@ex.ua'],
              ['02:22:17','Бонус Пират','принят','1+','7','1',100,100,'ktozdes@ex.ua'],
              ['02:21:44','bd19r8','принят','2+','4','1',800,800,'styd@ex.ua'],
              ['02:18:00','bd26r611','принят','3+','4','1',100,210,'styd@ex.ua'],
              ['02:17:56','bd22r142','принят','1+','3','1',100,100,'ktozdes@ex.ua'],
              ['02:17:09','bd14r85','принят','1+','4','1',100,100,'styd@ex.ua'],
              ['02:15:43','795молитва','принят','null','7','5',200,300,'strooks@ex.ua'],
              ['02:14:55','776юнкай','принят','null','5','6',200,200,'garem@ex.ua'],
              ['02:14:16','bd24r3714','принят','1+','4','1',100,100,'styd@ex.ua'],
              ['02:14:13','Бонус Удар дракона','принят','null','6','3',200,200,'viceversa@ex.ua'],
              ['02:14:05','bd11r739','принят','2','4','1',550,550,'styd@ex.ua'],
              ['02:12:40','745маллистер','принят','null','2','5',200,200,'garem@ex.ua'],
              ['02:11:53','bd12r48','принят','1','4','1',80,80,'styd@ex.ua'],
              ['02:10:38','bd3r4142','принят','1+','7','2',100,100,'viceversa@ex.ua'],
              ['02:10:09','767бастард','принят','null','4','7',200,200,'styd@ex.ua'],
              ['02:10:00','776чертог','принят','null','5','6',200,200,'garem@ex.ua'],
              ['02:09:59','Неведомый','принят','null','3','4',300,300,'viceversa@ex.ua'],
              ['02:09:47','bd23r443','принят','1','4','1',80,80,'styd@ex.ua'],
              ['02:09:25','br3d41172667','принят','1','4','1',80,80,'styd@ex.ua'],
              ['02:08:50','745бейлиш','принят','null','2','5',200,200,'garem@ex.ua'],
              ['02:08:46','bd8r4396','принят','1','4','1',80,80,'styd@ex.ua'],
              ['02:08:27','767дондаррион','принят','null','4','7',200,200,'styd@ex.ua'],
              ['02:08:14','bd18r43','принят','1+','4','1',100,100,'styd@ex.ua'],
              ['02:07:43','bd13r','принят','1+','4','1',100,100,'styd@ex.ua'],
              ['02:06:27','bd8r8844','принят','1','7','2',80,80,'viceversa@ex.ua'],
              ['02:06:04','Бонус Верность королю','принят','3','3','1',116,243,6,'styd@ex.ua'],
              ['02:05:58','pirates22','код доступа','null','7','',0,0,'strooks@ex.ua'],
              ['02:05:49','bd6r8428','принят','1','7','2',80,80,'viceversa@ex.ua'],
              ['02:03:45','bd29r772','принят','1+','3','1',100,100,'ktozdes@ex.ua'],
              ['02:02:48','bd21r24','принят','1+','3','1',100,100,'ktozdes@ex.ua'],
              ['02:02:13','Бонус Пират','принят','null','7','5',200,200,'ktozdes@ex.ua'],
              ['02:01:08','bd27r481','принят','1+','3','1',100,100,'ktozdes@ex.ua'],
              ['01:59:59','756тирион','принят','null','3','6',200,200,'viceversa@ex.ua'],
              ['01:59:53','bd2r745','принят','3+','7','2',100,100,'ktozdes@ex.ua'],
              ['01:58:43','gold777','код доступа','null','4','',0,0,'styd@ex.ua'],
              ['01:57:24','bd24r223','принят','1','3','1',80,80,'ktozdes@ex.ua'],
              ['01:56:22','bd31r1313','принят','2+','2','1',800,1040,'garem@ex.ua'],
              ['01:54:40','bd26r272985','принят','1','3','1',80,80,'ktozdes@ex.ua'],
              ['01:54:11','bd32r23','принят','3','2','1',116,116,'garem@ex.ua'],
              ['01:52:57','Бонус Удар дракона','принят','3+','7','1',100,100,'viceversa@ex.ua'],
              ['01:52:14','br2d7142874','принят','1+','3','1',100,100,'ktozdes@ex.ua'],
              ['01:48:49','756браавос','принят','null','3','6',200,300,'strooks@ex.ua'],
              ['01:48:47','bd33r5353','принят','3+','2','1',100,100,'garem@ex.ua'],
              ['01:47:00','Бонус Пират','принят','2','7','1',550,550,'ktozdes@ex.ua'],
              ['01:46:57','bd14r782','принят','1+','7','1',100,100,'viceversa@ex.ua'],
              ['01:46:31','756шагга','принят','null','3','6',200,200,'viceversa@ex.ua'],
              ['01:44:03','786септон','принят','null','6','6',200,200,'garem@ex.ua'],
              ['01:41:39','Бонус Подкуп','принят','2+','4','1',800,800,'sad@ex.ua'],
              ['01:38:09','bd22r33','принят','1','1','1',80,80,'styd@ex.ua'],
              ['01:37:46','bd2r3219','принят','2','2','1',550,715,'garem@ex.ua'],
              ['01:34:24','storm12','код доступа','null','3','',0,0,'viceversa@ex.ua'],
              ['01:34:08','bd6r49','принят','1','3','1',80,80,'ktozdes@ex.ua'],
              ['01:33:37','br2d384','принят','1','1','1',80,80,'styd@ex.ua'],
              ['01:33:04','745ракхаро','принят','null','2','5',200,200,'garem@ex.ua'],
              ['01:32:51','Бонус Удар дракона','принят','2','7','1',550,550,'viceversa@ex.ua'],
              ['01:32:34','776трезубец','принят','null','5','6',200,200,'garem@ex.ua'],
              ['01:30:32','bd24r41','принят','1','1','1',80,80,'styd@ex.ua'],
              ['01:30:31','whiteeagle','код доступа','null','5','',0,0,'sad@ex.ua'],
              ['01:30:29','bd27r7','принят','2+','2','1',800,1040,'garem@ex.ua'],
              ['01:29:40','Бонус Пират','принят','2+','3','1',800,960,'ktozdes@ex.ua'],
              ['01:29:32','bd28r838','принят','2+','1','1',800,800,'styd@ex.ua'],
              ['01:27:16','bd4r356','принят','3','1','1',116,243,6,'styd@ex.ua'],
              ['01:25:58','bd11r7891','принят','1','3','1',80,80,'ktozdes@ex.ua'],
              ['01:24:24','br3d6571','принят','1','1','1',80,80,'styd@ex.ua'],
              ['01:24:13','bd23r3','принят','1+','1','1',100,120,'sad@ex.ua'],
              ['01:24:01','bd26r6629','принят','2','1','1',550,550,'styd@ex.ua'],
              ['01:22:19','bd13r8424','принят','1','3','1',80,80,'ktozdes@ex.ua'],
              ['01:20:40','776зеленокровная','принят','null','5','6',200,200,'garem@ex.ua'],
              ['01:19:43','zd1r724','принят','bonus','0','1',100,100,'a@ex.ua'],
              ['01:19:42','bd16r51','принят','3+','1','1',100,210,'styd@ex.ua'],
              ['01:19:26','Бонус Песчаные змейки','принят','null','6','5',200,200,'garem@ex.ua'],
              ['01:19:01','bd27r78586','принят','1','1','1',80,96,'sad@ex.ua'],
              ['01:18:16','bd29r92','принят','1','1','1',80,96,'sad@ex.ua'],
              ['01:18:07','free','принят','free','5','0',100,100,'garem@ex.ua'],
              ['01:17:33','free','принят','free','5','0',100,100,'garem@ex.ua'],
              ['01:16:47','bd21r7','принят','1+','2','1',100,100,'garem@ex.ua'],
              ['01:15:29','bd18r51','принят','1','1','1',80,80,'styd@ex.ua'],
              ['01:15:29','br3d6571','принят','1','1','1',80,96,'sad@ex.ua'],
              ['01:14:30','737сандор','принят','null','1','7',200,200,'styd@ex.ua'],
              ['01:14:09','br2d384','принят','1','1','1',80,96,'sad@ex.ua'],
              ['01:14:08','bd15r','принят','1+','1','1',100,100,'styd@ex.ua'],
              ['01:14:02','bd24r41','принят','1','1','1',80,96,'sad@ex.ua'],
              ['01:13:28','bd7r225','принят','1+','1','1',100,120,'sad@ex.ua'],
              ['01:12:46','br3d1861','принят','3','7','1',116,116,'viceversa@ex.ua'],
              ['01:12:46','bd18r51','принят','1','1','1',80,96,'sad@ex.ua'],
              ['01:11:57','Бонус Удар дракона','принят','null','6','6',200,200,'viceversa@ex.ua'],
              ['01:11:29','bd3r4142','принят','1+','7','2',100,100,'ktozdes@ex.ua'],
              ['01:11:21','bd17r63','принят','1','1','1',80,96,'sad@ex.ua'],
              ['01:10:21','br2d8','принят','1+','2','1',100,100,'garem@ex.ua'],
              ['01:09:08','bd6r8428','принят','1','7','2',80,80,'ktozdes@ex.ua'],
              ['01:08:50','bd8r8844','принят','1','7','2',80,80,'ktozdes@ex.ua'],
              ['01:08:45','bd5r28','принят','1+','1','1',100,100,'styd@ex.ua'],
              ['01:07:47','Hint 1944 (цена -60,0)','получена подсказка','','','1',-60,-60,'sad@ex.ua'],
              ['01:07:36','bd32r842','принят','3','7','1',116,116,'viceversa@ex.ua'],
              ['01:07:12','bd15r9922','принят','1','2','1',80,80,'garem@ex.ua'],
              ['01:06:17','756ботли','принят','null','3','6',200,300,'strooks@ex.ua'],
              ['01:04:46','jon snow','принят','null','2','3',20,20,'garem@ex.ua'],
              ['01:04:27','fish17','код доступа','null','6','',0,0,'garem@ex.ua'],
              ['01:03:41','737эйгон','принят','null','1','7',200,300,'strooks@ex.ua'],
              ['01:02:27','bd3r1819','принят','2+','1','1',800,800,'sad@ex.ua'],
              ['01:02:17','bd13r73','принят','1+','1','1',100,100,'styd@ex.ua'],
              ['01:02:17','bd17r143','принят','1+','2','1',100,100,'garem@ex.ua'],
              ['01:02:16','bd5r448','принят','1','2','1',80,80,'garem@ex.ua'],
              ['01:02:05','756шагга','принят','null','3','6',200,300,'strooks@ex.ua'],
              ['01:01:58','bd33r333','принят','3','7','1',116,116,'viceversa@ex.ua'],
              ['01:01:34','bd12r66','принят','2','1','1',550,550,'styd@ex.ua'],
              ['01:01:16','bd12r66','принят','2','1','1',550,550,'sad@ex.ua'],
              ['01:01:10','bd19r119','принят','1+','2','1',100,100,'garem@ex.ua'],
              ['00:58:09','bd13r73','принят','1+','1','1',100,120,'sad@ex.ua'],
              ['00:58:01','Бонус Пират','принят','null','7','3',400,400,'ktozdes@ex.ua'],
              ['00:58:00','bd31r2213','принят','3+','7','1',100,100,'viceversa@ex.ua'],
              ['00:57:11','br1d11111','принят','1+','2','1',100,100,'garem@ex.ua'],
              ['00:56:15','viserys targaryen','принят','null','2','3',20,20,'garem@ex.ua'],
              ['00:53:46','rickon stark','принят','null','2','3',20,20,'garem@ex.ua'],
              ['00:53:28','bran stark','принят','null','2','3',20,20,'garem@ex.ua'],
              ['00:53:19','robb stark','принят','null','2','3',20,20,'garem@ex.ua'],
              ['00:52:43','arya stark','принят','null','2','3',20,20,'garem@ex.ua'],
              ['00:52:11','sansa stark','принят','null','2','3',20,20,'garem@ex.ua'],
              ['00:51:41','bd5r9119','принят','1','7','1',80,80,'viceversa@ex.ua'],
              ['00:50:40','bd3r2171','принят','2+','2','1',800,1040,'garem@ex.ua'],
              ['00:50:20','winter1304','код доступа','null','1','',0,0,'styd@ex.ua'],
              ['00:49:59','bd16r2429','принят','1+','2','1',100,100,'garem@ex.ua'],
              ['00:49:46','Бонус Удар дракона','принят','2+','6','1',800,800,'viceversa@ex.ua'],
              ['00:47:09','grey wind','принят','null','2','3',20,20,'garem@ex.ua'],
              ['00:44:36','t7t2','код доступа','null','7','',-500,-500,'ktozdes@ex.ua'],
              ['00:42:37','bd18r1984','принят','1','7','1',80,80,'viceversa@ex.ua'],
              ['00:42:18','bd7r2112','принят','1','7','1',80,80,'viceversa@ex.ua'],
              ['00:42:04','795алебарда','принят','null','7','5',200,200,'viceversa@ex.ua'],
              ['00:41:58','br1d32','принят','1','7','1',80,80,'viceversa@ex.ua'],
              ['00:39:09','bd22r38','принят','2','2','1',550,715,'garem@ex.ua'],
              ['00:38:56','795караван','принят','null','7','5',200,200,'viceversa@ex.ua'],
              ['00:37:29','bd22r411','принят','1+','7','1',100,100,'viceversa@ex.ua'],
              ['00:37:17','bd19r76','принят','1+','7','1',100,100,'ktozdes@ex.ua'],
              ['00:36:52','bd26r8','принят','1+','7','1',100,100,'viceversa@ex.ua'],
              ['00:36:34','756моргулис','принят','null','3','6',200,300,'strooks@ex.ua'],
              ['00:36:12','bd19r76','принят','1+','7','1',100,100,'viceversa@ex.ua'],
              ['00:36:08','Бонус Подкуп','принят','2+','4','1',800,800,'sad@ex.ua'],
              ['00:33:41','storm12','код доступа','null','3','',0,0,'ktozdes@ex.ua'],
              ['00:32:50','795молитва','принят','null','7','5',200,200,'viceversa@ex.ua'],
              ['00:29:37','Бонус Удар дракона','принят','3+','6','2',100,100,'viceversa@ex.ua'],
              ['00:29:21','795победа','принят','null','7','5',200,200,'viceversa@ex.ua'],
              ['00:29:00','bd17r','принят','1','7','1',80,80,'viceversa@ex.ua'],
              ['00:27:46','bd16r6621','принят','1+','7','1',100,100,'viceversa@ex.ua'],
              ['00:26:26','Рглор','принят','null','7','3',400,400,'viceversa@ex.ua'],
              ['00:26:04','bd3r184','принят','1','7','1',80,80,'viceversa@ex.ua'],
              ['00:25:25','bd25r4225','принят','2+','7','1',800,960,'ktozdes@ex.ua'],
              ['00:24:11','winter1304','код доступа','null','1','',0,0,'sad@ex.ua'],
              ['00:24:09','756мартелл','принят','null','3','6',200,300,'strooks@ex.ua'],
              ['00:23:40','bd13r3653','принят','1','7','1',80,80,'ktozdes@ex.ua'],
              ['00:23:11','bd9r9333','принят','1+','2','1',100,100,'garem@ex.ua'],
              ['00:23:06','bd1r99','принят','1','7','1',80,80,'viceversa@ex.ua'],
              ['00:21:45','Бонус Верность королю','принят','3+','3','1',100,210,'styd@ex.ua'],
              ['00:21:40','bd21r2133','принят','1','7','1',80,80,'viceversa@ex.ua'],
              ['00:21:33','bd13r3653','принят','1','7','1',80,80,'viceversa@ex.ua'],
              ['00:20:24','bd27r888','принят','1+','7','1',100,100,'viceversa@ex.ua'],
              ['00:19:46','bd8r12','принят','2+','2','1',800,1040,'garem@ex.ua'],
              ['00:19:35','bd28r8276','принят','1','7','1',80,80,'viceversa@ex.ua'],
              ['00:18:56','Hint 1960 (цена -60,0)','получена подсказка','','','4',-60,-60,'sad@ex.ua'],
              ['00:15:13','bd29r9929','принят','1+','2','1',100,100,'garem@ex.ua'],
              ['00:13:54','756тирион','принят','null','3','6',200,300,'strooks@ex.ua'],
              ['00:12:53','795засада','принят','null','7','5',200,200,'viceversa@ex.ua'],
              ['00:12:30','795летопись','принят','null','7','5',200,200,'viceversa@ex.ua'],
              ['00:11:56','bd14r85','принят','1+','4','1',100,120,'sad@ex.ua'],
              ['00:10:47','bd13r8424','принят','1','3','1',80,80,'styd@ex.ua'],
              ['00:10:07','t7t2','код доступа','null','7','',-500,-500,'viceversa@ex.ua'],
              ['00:09:50','storm12','код доступа','null','3','',0,0,'strooks@ex.ua'],
              ['00:09:33','Бонус Удар дракона','принят','2+','7','1',800,800,'viceversa@ex.ua'],
              ['00:09:02','питахайя','принят','null','7','4',400,400,'viceversa@ex.ua'],
              ['00:06:59','bd23r6511','принят','1+','2','1',100,100,'garem@ex.ua'],
              ['00:06:06','bd28r77','принят','1+','2','1',100,100,'garem@ex.ua'],
              ['00:06:06','br3d','принят','1','2','1',80,80,'garem@ex.ua'],
              ['00:02:24','pirates22','код доступа','null','7','',0,0,'viceversa@ex.ua'],
              ['23:59:58','bd26r424','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['23:57:25','776ланниспорт','принят','null','5','6',200,200,'garem@ex.ua'],
              ['23:55:12','br3d41172667','принят','1','4','1',80,96,'sad@ex.ua'],
              ['23:54:18','shaggydog','принят','null','2','3',20,20,'garem@ex.ua'],
              ['23:53:47','bd21r9161','принят','1+','4','1',100,120,'sad@ex.ua'],
              ['23:53:40','whiteeagle','код доступа','null','5','',0,0,'garem@ex.ua'],
              ['23:52:14','summer','принят','null','2','3',20,20,'garem@ex.ua'],
              ['23:51:48','viserion','принят','null','2','3',20,20,'garem@ex.ua'],
              ['23:51:27','nymeria','принят','null','2','3',20,20,'garem@ex.ua'],
              ['23:50:36','rhaegal','принят','null','2','3',20,20,'garem@ex.ua'],
              ['23:50:23','bd8r1212','принят','2+','3','1',800,800,'styd@ex.ua'],
              ['23:48:57','Бонус Удар дракона','принят','2+','6','1',800,800,'viceversa@ex.ua'],
              ['23:48:14','drogon','принят','null','2','3',20,20,'garem@ex.ua'],
              ['23:45:56','bd17r7411','принят','3+','4','1',100,100,'sad@ex.ua'],
              ['23:44:21','Хилл','принят','null','1','6',200,300,'strooks@ex.ua'],
              ['23:43:42','bd20r2783','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['23:43:21','bd19r7755','принят','2','6','1',550,550,'viceversa@ex.ua'],
              ['23:43:09','bd18r43','принят','1+','4','1',100,120,'sad@ex.ua'],
              ['23:39:38','bd10r7842','принят','3+','6','2',100,100,'viceversa@ex.ua'],
              ['23:38:59','bd27r888','принят','1+','7','1',100,100,'ktozdes@ex.ua'],
              ['23:37:46','bd9r9612','принят','1+','4','1',100,120,'sad@ex.ua'],
              ['23:36:34','bd27r481','принят','1+','3','1',100,100,'styd@ex.ua'],
              ['23:36:28','bd22r411','принят','1+','7','1',100,100,'ktozdes@ex.ua'],
              ['23:36:05','bd5r9119','принят','1','7','1',80,80,'ktozdes@ex.ua'],
              ['23:35:42','bd29r772','принят','1+','3','1',100,100,'styd@ex.ua'],
              ['23:35:27','bd5r27','принят','1+','3','1',100,100,'styd@ex.ua'],
              ['23:34:27','br3d74','принят','1+','3','1',100,100,'styd@ex.ua'],
              ['23:34:05','bd4r76823','принят','1+','3','1',100,100,'styd@ex.ua'],
              ['23:33:55','bd21r4499','принят','1','6','1',80,80,'viceversa@ex.ua'],
              ['23:33:16','bd24r223','принят','1','3','1',80,80,'styd@ex.ua'],
              ['23:31:42','bd24r183','принят','1+','7','1',100,100,'ktozdes@ex.ua'],
              ['23:31:33','bd27r7374','принят','2','6','1',550,550,'viceversa@ex.ua'],
              ['23:29:14','bd28r112233','принят','1','6','1',80,80,'viceversa@ex.ua'],
              ['23:28:32','bd2r8','принят','1+','6','2',100,100,'viceversa@ex.ua'],
              ['23:28:28','bd24r4','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['23:28:15','bd7r874','принят','3+','6','2',100,100,'viceversa@ex.ua'],
              ['23:28:03','br1d427','принят','2+','3','1',800,800,'styd@ex.ua'],
              ['23:27:24','bd6r117','принят','3','6','2',116,116,'viceversa@ex.ua'],
              ['23:27:09','Бонус Подкуп','принят','2+','4','1',800,800,'sad@ex.ua'],
              ['23:27:00','Бонус Удар дракона','принят','2+','6','1',800,800,'viceversa@ex.ua'],
              ['23:25:28','bd25r17','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['23:24:36','bd4r1','принят','1+','4','1',100,120,'sad@ex.ua'],
              ['23:23:36','bd11r7891','принят','1','3','1',80,80,'styd@ex.ua'],
              ['23:23:20','bd30r1818','принят','1','6','1',80,80,'viceversa@ex.ua'],
              ['23:22:25','795летопись','принят','null','7','5',200,200,'ktozdes@ex.ua'],
              ['23:21:13','bd15r1','принят','1+','7','1',100,100,'ktozdes@ex.ua'],
              ['23:20:49','bd5r75','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['23:20:35','bd8r4396','принят','1','4','1',80,96,'sad@ex.ua'],
              ['23:20:06','bd16r6621','принят','1+','7','1',100,100,'ktozdes@ex.ua'],
              ['23:19:51','bd12r7289','принят','1+','7','1',100,100,'ktozdes@ex.ua'],
              ['23:19:40','bd16r444','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['23:19:15','bd8r234','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['23:18:59','795молитва','принят','null','7','5',200,200,'ktozdes@ex.ua'],
              ['23:18:14','bd1r445','принят','1+','6','2',100,100,'viceversa@ex.ua'],
              ['23:17:45','bd8r4432','принят','3','6','2',116,116,'viceversa@ex.ua'],
              ['23:17:43','bd15r7841','принят','1+','3','1',100,100,'styd@ex.ua'],
              ['23:17:19','bd1r272','принят','2+','6','1',800,800,'viceversa@ex.ua'],
              ['23:16:08','bd11r','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['23:16:04','bd4r478','принят','1+','6','2',100,100,'viceversa@ex.ua'],
              ['23:15:59','bd7r4312','принят','2+','3','1',800,800,'styd@ex.ua'],
              ['23:15:28','bd28r8276','принят','1','7','1',80,80,'ktozdes@ex.ua'],
              ['23:15:01','795победа','принят','null','7','5',200,200,'ktozdes@ex.ua'],
              ['23:14:57','bd2r2865','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['23:14:44','bd6r49','принят','1','3','1',80,80,'styd@ex.ua'],
              ['23:14:22','bd3r67','принят','1+','6','1',100,100,'viceversa@ex.ua'],
              ['23:14:08','bd17r','принят','1','7','1',80,80,'ktozdes@ex.ua'],
              ['23:13:30','bd21r2133','принят','1','7','1',80,80,'ktozdes@ex.ua'],
              ['23:12:52','bd9r441','принят','3','6','2',116,116,'viceversa@ex.ua'],
              ['23:12:37','bd1r171','принят','3','4','1',116,116,'sad@ex.ua'],
              ['23:11:01','795караван','принят','null','7','5',200,200,'ktozdes@ex.ua'],
              ['23:08:15','bd3r124','принят','1','6','2',80,80,'viceversa@ex.ua'],
              ['23:08:15','питайя','принят','null','7','4',400,400,'ktozdes@ex.ua'],
              ['23:07:58','737сандор','принят','null','1','7',200,300,'strooks@ex.ua'],
              ['23:07:52','Брандон Старк','принят','null','1','4',200,300,'strooks@ex.ua'],
              ['23:06:52','bd11r739','принят','2','4','1',550,550,'sad@ex.ua'],
              ['23:06:47','Бонус Удар дракона','принят','2+','6','1',800,800,'viceversa@ex.ua'],
              ['23:06:17','786вонючка','принят','null','6','6',200,200,'viceversa@ex.ua'],
              ['23:05:58','bd13r','принят','1+','4','1',100,120,'sad@ex.ua'],
              ['23:03:46','bd12r48','принят','1','4','1',80,96,'sad@ex.ua'],
              ['23:03:41','737рейго','принят','null','1','7',200,300,'strooks@ex.ua'],
              ['23:03:04','786септон','принят','null','6','6',200,200,'viceversa@ex.ua'],
              ['23:03:04','795засада','принят','null','7','5',200,200,'ktozdes@ex.ua'],
              ['23:00:42','bd26r272985','принят','1','3','1',80,80,'styd@ex.ua'],
              ['23:00:38','bd23r443','принят','1','4','1',80,96,'sad@ex.ua'],
              ['23:00:22','bd24r3714','принят','1+','4','1',100,120,'sad@ex.ua'],
              ['22:59:46','786кольчуга','принят','null','6','6',200,200,'viceversa@ex.ua'],
              ['22:58:27','drogo','принят','null','2','3',20,20,'garem@ex.ua'],
              ['22:57:53','786королева','принят','null','6','6',200,200,'viceversa@ex.ua'],
              ['22:55:02','737санса','принят','null','1','7',200,300,'strooks@ex.ua'],
              ['22:54:06','Серый Ветер','принят','null','6','5',200,200,'viceversa@ex.ua'],
              ['22:53:55','targaryen','принят','null','2','3',20,20,'garem@ex.ua'],
              ['22:52:14','786переправа','принят','null','6','6',200,200,'viceversa@ex.ua'],
              ['22:50:57','storm12','код доступа','null','3','',0,0,'styd@ex.ua'],
              ['22:50:47','pirates22','код доступа','null','7','',0,0,'ktozdes@ex.ua'],
              ['22:47:01','t6t2','код доступа','null','6','',-500,-500,'viceversa@ex.ua'],
              ['22:46:39','Бонус Удар дракона','принят','2+','6','1',800,800,'viceversa@ex.ua'],
              ['22:46:19','gold777','код доступа','null','4','',0,0,'sad@ex.ua'],
              ['22:45:43','winter1304','код доступа','null','1','',0,0,'strooks@ex.ua'],
              ['22:44:47','lady','принят','null','2','3',20,20,'garem@ex.ua'],
              ['22:31:36','dorn1234','код доступа','null','2','',0,0,'garem@ex.ua'],
              ['22:28:55','fri_dr15','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','f14_free','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','free__13_code','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','12_in_reserve','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','_11_free','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','free10__','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','res9code__','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','free8_reserv','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','7free7','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','res6free','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','free5_code','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','code4free','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','reserve_3','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','free2free','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:28:55','free1','принят','Null','0','1',100,100,'garem@ex.ua'],
              ['22:26:49','fish17','код доступа','null','6','',0,0,'a@ex.ua'],
              ['22:26:26','Бонус Удар дракона','принят','null','6','4',400,400,'viceversa@ex.ua'],
              ['22:25:48','storm12','код доступа','null','3','',0,0,'a@ex.ua'],
              ['22:25:13','fish17','код доступа','null','6','',0,0,'viceversa@ex.ua'],
              ['22:25:04','pirates22','код доступа','null','7','',0,0,'a@ex.ua'],
              ['22:24:58','whiteeagle','код доступа','null','5','',0,0,'a@ex.ua'],
              ['22:24:52','dorn1234','код доступа','null','2','',0,0,'a@ex.ua'],
              ['22:24:18','winter1304','код доступа','null','1','',0,0,'a@ex.ua'],
              ['22:24:14','gold777','код доступа','null','4','',0,0,'a@ex.ua']]

      log = log.reverse

      zones = %w(1 2 3 4 5 6 7)
      teams = ["styd@ex.ua", "viceversa@ex.ua", "garem@ex.ua", "ktozdes@ex.ua", "sad@ex.ua", "strooks@ex.ua"]
      zone_holders = {}
      zones.each {|z| zone_holders[z] = {team: nil, sum: 0, time: nil} }
      result = {}
      teams.each do |t|
        result[t] = {}
        zones.each { |z| result[t][z] = {sum: 0, bonus: 0} }

      end

      log.each do |l|
        new_team = l[8]
        amount = l[7]
        new_zone = l[4]
        time = Time.parse(l[0])
        time -= 1.day if time > Time.parse('09:00:00')
        next if (new_team[0] == 'a') || (new_zone == "0") || (amount == 0)

        begin
          result[ new_team ][new_zone][:sum] += amount
          # Does the new team have the best sum in zone?
          if result[ new_team ][new_zone][:sum] > zone_holders[new_zone][:sum]
            # Check if this is the new holder
            if zone_holders[new_zone][:team] == new_team
              zone_holders[new_zone][:sum] = result[ new_team ][new_zone][:sum]
            else
              # count bonus
              old_team = zone_holders[new_zone][:team]
              if old_team.present?
                old_bonus = 0
                old_bonus = ((time - zone_holders[new_zone][:time]).to_i / 1800) * 45 if zone_holders[new_zone][:time].present?
                result[old_team][new_zone][:bonus] += old_bonus
              end

              # change holders data
              zone_holders[new_zone][:time] = time
              zone_holders[new_zone][:team] = new_team
              zone_holders[new_zone][:sum] = result[ new_team ][new_zone][:sum]
            end

          end
        rescue Exception => e
          puts [l, e]
        end
      end

      zones.each do |zone|
        time = Time.parse("07:00:00")

        begin
          old_team = zone_holders[zone][:team]
          old_bonus = 0
          old_bonus = ((time - zone_holders[zone][:time]).to_i / 1800) * 45 if zone_holders[zone][:time].present?
          result[old_team][zone][:bonus] += old_bonus
        rescue Exception => e
          puts [zone, e]
        end
      end

      # total
      teams.each do |team|
        sum = 0
        bonus = 0
        zones.each do |zone|
          sum += result[team][zone][:sum] || 0
          bonus += result[team][zone][:bonus] || 0
        end
        result[team]["8"] = {sum: sum, bonus: bonus}
      end

      {bonuses: result, holders: zone_holders}
    end

    ##
    # Total statistics of the Game with game_type='zones'
    #
    # Params:
    # - params {Hash} - Hash with Game:
    #  - game {Game} - Game whose results should be created
    #
    def total_zones(params)
      game = params[:game]
      if game.is_archived?
        log = game.archive_logs.order(:created_at)
        zone_field = 'archive_zone'
        team_field = 'archive_team_zone'
      else
        log_filter = [Code::STATES.index(:accepted), Code::STATES.index(:accessed), Code::STATES.index(:hint_accessed), Code::STATES.index(:attached)]
        log = game.logs.where(result_code: log_filter).order(:created_at)
        zone_field = 'zone_field'
        team_field = 'team_zone'
      end
      zones = game.send(zone_field.pluralize).map(&:id)
      teams = game.send(team_field.pluralize).map(&:id)
      finish_time = game.finish_date

      zone_holders = {}
      zones.each {|z| zone_holders[z] = {team: nil, sum: 0, time: nil} }
      result = {}
      teams.each do |t|
        result[t] = {}
        zones.each { |z| result[t][z] = {sum: 0, bonus: 0} }
      end

      log.each do |l|
        new_team = l.team_id
        debugger
        amount = l.team_code.bonus
        new_zone = l.team_code.send(zone_field).try(:id)
        time = l.created_at
        next if (new_team[0] == 'a') || (new_zone.blank?) || (amount == 0) || (time > finish_time)

        begin
          result[ new_team ][new_zone][:sum] += amount
          # Does the new team have the best sum in zone?
          if result[ new_team ][new_zone][:sum] > zone_holders[new_zone][:sum]
            # Check if this is the new holder
            if zone_holders[new_zone][:team] == new_team
              zone_holders[new_zone][:sum] = result[ new_team ][new_zone][:sum]
            else
              # count bonus
              old_team = zone_holders[new_zone][:team]
              if old_team.present?
                old_bonus = 0
                old_bonus = ((time - zone_holders[new_zone][:time]).to_i / game.hold_time) * game.hold_bonus if zone_holders[new_zone][:time].present?
                result[old_team][new_zone][:bonus] += old_bonus
              end

              # change holders data
              zone_holders[new_zone][:time] = time
              zone_holders[new_zone][:team] = new_team
              zone_holders[new_zone][:sum] = result[ new_team ][new_zone][:sum]
            end

          end
        rescue Exception => e
          puts ["#{l.class.name}.id=#{l.id}", 'Exception:', e].join(' ')
        end
      end

      zones.each do |zone|
        begin
          old_team = zone_holders[zone][:team]
          old_bonus = 0
          old_bonus = ((finish_time - zone_holders[zone][:time]).to_i / game.hold_time) * game.hold_bonus if zone_holders[zone][:time].present?
          result[old_team][zone][:bonus] += old_bonus
        rescue Exception => e
          puts ["#{zone.class.name}.id=#{zone.id}", 'Exception:', e].join(' ')
        end
      end

      # total
      teams.each do |team|
        sum = 0
        bonus = 0
        zones.each do |zone|
          sum += result[team][zone][:sum] || 0
          bonus += result[team][zone][:bonus] || 0
        end
        result[team]["total"] = {sum: sum, bonus: bonus}
      end

      {bonuses: result, holders: zone_holders}
    end

  end
end